# Дано натуральное число. Выведите его последнюю цифру.
a=int(input())
print(a%10)