# N школьников делят K яблок поровну, неделящийся остаток остается в корзинке. Сколько яблок достанется каждому школьнику?
# Входные данные
# Программа получает на вход числа N и K.
# Выходные данные
# Программа должна вывести искомое количество яблок.

a=int(input())
b=int(input())
print(b//a)