#Дано целое число n. Выведите следующее за ним четное число. 
#При решении этой задачи нельзя использовать условную инструкцию if и циклы.
a=int(input())
print(a+2-(a%2))