#Дано двузначное число. Найдите число десятков в нем.
a=int(input())
print(a//10%10)